export default class ErrorRepository {
  constructor() {
    this.members = new Map(
      [
        [100, "продолжайте"],
        [101, "переключение протоколов"],
        [102, "идёт обработка"],
        [103, "ранняя метаинформация"],
        [200, "хорошо"],
        [201, "создано"],
        [202, "принято"],
        [203, "информация не авторитетна"],
        [204, "нет содержимого"],
        [205, "сбросить содержимое"],
        [206, "частичное содержимое"],
        [207, "многостатусный"],
        [208, "уже сообщалось"],
      ]
    );
  }

  translate(code) {
    if (this.members.has(code) == true) {
      return this.members.get(code)
    } else {
      return 'Unknown error'
    }
  }

}

